Revit 2026 API

# IndexStreamPoint Properties

---

The IndexStreamPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from IndexStream) |

#### Reference

IndexStreamPoint Class

Autodesk.Revit.DB.DirectContext3D Namespace